/* Лабораторна робота № 3
Варіант No4.
Умова:
Користувач вводить три цілих числа А, В і С. Вивести на екран всі числа з інтервалу від А до В,
які є парними та кратні С, та підрахувати їх кількість.
Розробити блок-схему та написати програму, використовуючи оператори циклу та
умовний оператор.
                                                                        ***
Що робить ця програма/цей код:
Цей код зчитує три цілі числа a, b і c з введення користувача за допомогою cin.
Потім використовується цикл для перебору всіх чисел в інтервалі від a до b.
Якщо поточне число i парне і кратне c, воно виводиться на екран і лічильник count збільшується на 1.
Після завершення циклу виводиться загальна кількість чисел, що задовольняють умові, за допомогою cout.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Запуск: програма запускається, і користувач вводить три цілі числа a, b і c.
2. Ініціалізація змінних: кількість змінних ініціалізується рівним 0, який використовуватиметься для підрахунку кількості чисел, що задовольняють умови.
3. Цикл: цикл for використовується для перебору всіх чисел в інтервалі [a, b].
4. Умови перевірки: у циклі оператор if перевіряє, чи поточне число i є парним і ділиться на c.
5. Збільшити лічильник: якщо умови виконуються, число друкується на екрані, а значення лічильника збільшується на 1.
6. Повторення: цикл продовжується, доки не будуть оброблені всі числа в інтервалі [a, b].
7. Вихідний результат: після завершення циклу кінцеве значення лічильника друкується на екрані.
8. Кінець: програма завершується.
*/

#include <iostream>

using namespace std;

int main()
{
  int a, b, c, count = 0;
  cin >> a >> b >> c;

  for (int i = a; i <= b; i++)
  {
    if (i % 2 == 0 && i % c == 0)
    {
      cout << i << " ";
      count++;
    }
  }

  cout << endl
       << "Count: " << count << endl;
  return 0;
}
