/* Лабораторна робота № 10
Варіант No1.
Умова:
Дано рядок. Підрахувати кількість цифр, що містяться в ньому. Знайти найбільшу кількість цифр, що йдуть у тексті поспіль.
                                                                        ***
Що робить ця програма/цей код:
У цій програмі ми спочатку зчитуємо рядок із клавіатури за допомогою функції cin.getline().
Далі, у циклі проходимо по всьому рядку та перевіряємо, чи є поточний символ цифрою.
Якщо так, збільшуємо лічильник count та перевіряємо, чи більше count поточного значення maxCount.
Якщо так, то оновлюємо maxCount значенням count. Якщо наступний символ не є цифрою, то скидаємо лічильник count до нуля.
Наприкінці циклу, у нас буде підраховано кількість цифр у рядку, а також найбільшу кількість цифр, що йдуть поспіль.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Введення рядка символів із клавіатури за допомогою функції cin
2. Оголошення змінних: currCount для зберігання поточної кількості цифр, що йдуть поспіль, maxCount для зберігання максимальної кількості цифр, що йдуть поспіль, і totalCount для зберігання загальної кількості цифр у рядку.
3. Використання циклу for для перебору всіх символів у рядку
4. Перевірка, чи є поточний символ цифрою за допомогою функції isdigit
5. Якщо поточний символ є цифрою, збільшити лічильник currCount на 1 і оновити значення maxCount, якщо currCount став більшим, ніж maxCount
6. Якщо поточний символ не є цифрою, встановити currCount 0
7. Після завершення циклу, друкувати загальну кількість цифр totalCount та максимальну кількість цифр maxCount.
*/

#include <iostream>
#include <cstring>

using namespace std;

int main()
{
    char str[100];
    int count = 0, maxCount = 0, currentCount = 0;

    cin.getline(str, 100);
    int len = strlen(str);

    for (int i = 0; i < len; i++)
    {
        if (isdigit(str[i]))
        {
            count++;
            currentCount++;
            if (currentCount > maxCount)
            {
                maxCount = currentCount;
            }
        }
        else
        {
            currentCount = 0;
        }
    }

    cout << "Количество цифр в строке: " << count << endl;
    cout << "Наибольшее количество цифр, идущих подряд: " << maxCount << endl;

    return 0;
}
