/* Лабораторна робота № 6
Варіант No1.
Умова:
Створити функцію Sign(Х) цілого типу, що повертає для дійсного числа X його знак ,
тобто такі значення: -1 якщо X<0, 0, якщо X=0; 1, якщо X>0.
За допомогою цієї функції знайти значення виразу Sign(A) + Sign(B) для даних дійсних чисел А та В.
                                                                        ***
Що робить ця програма/цей код:
У цій програмі спочатку оголошується функція Sign з одним аргументом типу double x.
Функція повертає значення типу int, що визначається значенням аргументу x.
Якщо x менше 0, то функція поверне -1. Якщо x дорівнює 0, то функція поверне 0.
Інакше, якщо x більше 0, функція поверне 1.

У основні функції зчитуються два значення типу double A і B за допомогою cin.
Потім обчислюється результат функції Sign кожного з них і підсумовується.
Результат обчислення функції Sign для A і B надається змінної result.
Значення результату виводиться на екран за допомогою cout.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Визначаємо функцію Sign, яка приймає один параметр X типу float.
2. Всередині функції Sign використовуємо умовний оператор, щоб перевірити значення X.
3. Якщо X < 0, функція поверне -1.
4. Якщо X = 0, функція поверне 0.
5. Якщо X > 0, функція поверне 1.
6. В основній програмі визначаємо два дійсні числа A та B.
7. Викликаємо функцію Sign для кожного з цих чисел.
8. Додаємо результати для кожного числа та виводимо на екран підсумкову суму.
*/
#include <iostream>

int Sign(double x)
{
   if (x < 0)
   {
      return -1;
   }
   else if (x == 0)
   {
      return 0;
   }
   else
   {
      return 1;
   }
}

int main()
{
   double A, B;
   std::cin >> A >> B;
   int result = Sign(A) + Sign(B);
   std::cout << result << std::endl;
   return 0;
}
