/* Лабораторна робота № 1
Варіант No1.
Умова:
Обчислити периметр і площу ромба в першому випадку
за допомогою змінних типу int, в другому випадку за допомогою змінних типу float.
Всі необхідні розміри вводяться з клавіатури.
                                                                        ***
Що робить ця програма/цей код:
Цей код спочатку обчислює периметр і площу ромба за допомогою int змінних d1, d2, p, і s.
Потім довжини діагоналей ромба вводяться з клавіатури cin. Периметр та площа обчислюються за допомогою формули.
Потім повторюється той самий процес, але з використанням float.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Включення бібліотек: На початку коду включаються бібліотеки iostream і cmath для введення та виведення даних та для математичних обчислень відповідно.
2. Оголошення змінних: Далі оголошуються змінні типу int для обчислення периметра та площі ромба, а також змінні типу float для обчислення з використанням float.
3. Введення довжин діагоналей: Потім користувач запрошується ввести довжини діагоналей ромба за допомогою cin.
4. Обчислення периметра та площі: Далі периметр та площа обчислюються за допомогою формули.
5. Виведення результатів: Периметр та площа ромба виводяться на екран за допомогою cout.
6. Завершення програми: Програма завершується із поверненням значення 0.
*/

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
  // Обчислення периметра та площі ромба за допомогою int
  int d1, d2, p, s;
  cout << "Введите длину диагоналей ромба: ";
  cin >> d1 >> d2;
  p = 2 * sqrt(d1 * d1 + d2 * d2);
  s = d1 * d2 / 2;
  cout << "Периметр ромба (int): " << p << endl;
  cout << "Площадь ромба (int): " << s << endl;

  // Обчислення периметра та площі ромба за допомогою float
  float d1f, d2f, pf, sf;
  cout << "Введите длину диагоналей ромба: ";
  cin >> d1f >> d2f;
  pf = 2 * sqrt(d1f * d1f + d2f * d2f);
  sf = d1f * d2f / 2;
  cout << "Периметр ромба (float): " << pf << endl;
  cout << "Площадь ромба (float): " << sf << endl;

  return 0;
}
