/* Задача № 10
Умова:
На площині задано кількість точок (не більш 10) та їхні координати.
Знайти дві точки, які розташовані якнайближче одна до одної.
                                                                        ***
Що робить ця програма/цей код:
Ця програма запитує користувача кількість точок та їх координати, а потім знаходить дві точки,
які знаходяться на мінімальній відстані один від одного.
Для цього програма використовує функцію distance, яка обчислює відстань між двома точками на площині,
а також вкладений цикл для знаходження всіх пар точок та визначення мінімальної відстані між ними.
В результаті програма виводить координати знайдених точок та відстань між ними.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Підключаються необхідні заголовні файли.
2. Вводиться кількість точок та їх координати.
    Векторні пункти типу vector<pair<int, int>> використовуються для зберігання координат усіх точок.
    Цикл for використовується для заповнення векторних пунктів користувальницькими координатами.
3. Ініціалізується змінна minDistance значенням нескінченності та оголошуються змінні closestPoint1 та closestPoint2,
    які зберігатимуть координати двох найближчих точок.
4. Вкладений цикл for перебирає всі можливі комбінації точок із векторами points.
    Викликається функція distance для обчислення відстані між кожною парою точок.
    Якщо відстань менша за поточне значення minDistance, то оновлюються змінні minDistance, closestPoint1 і closestPoint2.
5. Виводяться координати знайдених точок та відстань між ними.
*/

#include <iostream>
#include <cmath>
#include <vector>
#include <utility>

using namespace std;

// Функция для вычисления расстояния между двумя точками
double distance(pair<int, int> p1, pair<int, int> p2)
{
    double dx = p2.first - p1.first;
    double dy = p2.second - p1.second;
    return sqrt(dx * dx + dy * dy);
}

int main()
{
    // Запросить у пользователя количество точек и их координаты
    int n;
    cout << "Введите количество точек: ";
    cin >> n;

    vector<pair<int, int>> points(n);
    for (int i = 0; i < n; i++)
    {
        int x, y;
        cout << "Введите координаты точки " << i + 1 << ": ";
        cin >> x >> y;
        points[i] = make_pair(x, y);
    }

    // Инициализировать минимальное расстояние значением бесконечности
    double minDistance = INFINITY;
    pair<int, int> closestPoint1, closestPoint2;

    // Найти две точки, расположенные как можно ближе друг к другу
    for (int i = 0; i < n; i++)
    {
        for (int j = i + 1; j < n; j++)
        {
            double d = distance(points[i], points[j]);
            if (d < minDistance)
            {
                minDistance = d;
                closestPoint1 = points[i];
                closestPoint2 = points[j];
            }
        }
    }

    // Вывести результат
    cout << "Две точки, расположенные как можно ближе друг к другу: (" << closestPoint1.first << ", " << closestPoint1.second << ") и ("
         << closestPoint2.first << ", " << closestPoint2.second << "), расстояние между ними: " << minDistance << endl;

    return 0;
}
