/* Задача № 3
Умова:
Написати програму, яка б видавала інформацію про введений символ – цифра, мала чи велика літера.
                                                                        ***
Що робить ця програма/цей код:
Програма запитує у користувача введення символу, потім визначає, чи він цифрою, малої або великої літерою,
і виводить відповідне повідомлення. Функції єdigit, islower і isupper з бібліотеки ctype.h використовуються для перевірки типу знака.
Якщо символ, що вводиться, не є ні цифрою, ні буквою, то програма виводить повідомлення про це.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Запитати користувача вхідний символ.
2. Перевірити, чи символ є цифрою. Якщо так, вивести інформацію про те, що введений символ є цифрою.
3. Якщо символ не є цифрою, перевірте, чи є символ малою літерою. Якщо так, вивести інформацію про те, що введений символ є малою літерою.
4.Якщо символ не є цифрою або малою літерою, перевірити, чи є символ великої літерою. Якщо так, вивести інформацію про те, що введений символ є великою літерою.
5. Якщо символ не є цифрою, малою або великою літерою, вивести повідомлення про помилку.
*/

#include <iostream>
#include <cctype>

using namespace std;

int main()
{
    char ch;

    cout << "Введите символ: ";
    cin >> ch;

    if (isdigit(ch))
    {
        cout << "Вы ввели цифру." << endl;
    }
    else if (islower(ch))
    {
        cout << "Вы ввели строчную букву." << endl;
    }
    else if (isupper(ch))
    {
        cout << "Вы ввели прописную букву." << endl;
    }
    else
    {
        cout << "Вы ввели символ, который не является цифрой или буквой." << endl;
    }

    return 0;
}
