/* Задача № 5
Умова:
Написати програму, яка б визначала кількість слів у заданому тексті
                                                                        ***
Що робить ця програма/цей код:
У цій програмі використовується функція isalnum() з бібліотеки cctype для перевірки, чи поточний символ є буквою або цифрою.
Функція getline() із бібліотеки string використовується для введення рядка тексту.
Цикл for проходить по кожному символу в рядку, використовуючи індекс, а не цикл for-each,
оскільки потрібно обробляти символи окремо, а не пакетами.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Створити рядок, у якому буде збережено текст для аналізу.
2. Запитати в користувача введення тексту та зберегти його у створений рядок.
3. Створити змінну для підрахунку кількості слів та встановити її значення рівним 0.
4. Створити змінну-прапор для відстеження того, що поточний символ є частиною слова.
5. Проітеруватись за символами у рядку, використовуючи цикл for або while.
6. Для кожного символу виконати таке:
    1.Якщо символ є буквою або цифрою, встановити прапор, що поточний символ є частиною слова.
    2.Якщо символ не є літерою або цифрою і прапор встановлено, збільшити лічильник слів і скинути прапор.
7. Вивести результат – кількість слів у тексті.
*/

#include <iostream>
#include <string>

using namespace std;

int main()
{
    // Запросить у пользователя ввод текста
    string text;
    cout << "Введите текст: ";
    getline(cin, text);

    // Подсчитать количество слов в тексте
    int wordCount = 0;
    bool inWord = false;
    for (int i = 0; i < text.length(); i++)
    {
        if (isalnum(text[i]))
        { // текущий символ является частью слова
            inWord = true;
        }
        else if (inWord)
        { // текущий символ не является частью слова, а предыдущий был
            wordCount++;
            inWord = false;
        }
    }
    if (inWord)
    { // проверка на случай, если текст заканчивается на слово
        wordCount++;
    }

    // Вывести результат
    cout << "Количество слов в тексте: " << wordCount << endl;

    return 0;
}
