/* Задача № 6
Умова:
Написати програму, яка б визначала кількість літер у кожному слові заданого речення.
                                                                        ***
Що робить ця програма/цей код:
Програма приймає текст і визначає кількість вживань заданого символу в кожному реченні.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Спочатку ми оголошуємо необхідні бібліотеки та використовуємо using namespace std;, щоб не писати скрізь приставку std::.
2. Потім оголошуємо головну функцію main().
3. Далі, ми оголошуємо змінну текст типу string для збереження введеного користувачем тексту.
    Використовуємо функцію getline(), щоб рахувати весь текст до кінця рядка (натискання клавіші Enter) та зберігаємо його в змінну text.
4. Створюємо змінну charCount для зберігання кількості символів у кожному слові,
    а також змінну wordCount для зберігання загальної кількості слів.
5. Далі ми перебираємо кожен символ у тексті за допомогою циклу for, починаючи з першого символу і закінчуючи останнім символом.
    Якщо поточний символ є буквою, ми збільшуємо лічильник символів у слові charCount.
    Якщо поточний символ не є буквою (наприклад, це пропуск або знак пунктуації), то ми збільшуємо лічильник wordCount на 1 і скидаємо лічильник символів charCount до 0.
6. Нарешті ми виводимо кількість символів в останньому слові (якщо в тексті немає знаків пунктуації,
    то лічильник charCount не буде скинутий до 0 наприкінці циклу) і виводимо загальну кількість слів у тексті.
7. Завершуємо функцію main() за допомогою return 0;
*/

#include <iostream>
#include <string>
#include <vector>

using namespace std;

int main()
{
    // Считать предложение
    string sentence;
    cout << "Введите предложение: ";
    getline(cin, sentence);

    // Подсчитать количество букв в каждом слове
    vector<int> letterCounts; // массив для хранения количества букв в каждом слове
    int letterCount = 0;      // счетчик букв в текущем слове
    for (int i = 0; i < sentence.length(); i++)
    {
        if (isalpha(sentence[i]))
        { // текущий символ является буквой
            letterCount++;
        }
        else if (letterCount > 0)
        { // текущий символ не является буквой, а предыдущий был
            letterCounts.push_back(letterCount);
            letterCount = 0;
        }
    }
    if (letterCount > 0)
    { // проверка на случай, если предложение заканчивается на слово
        letterCounts.push_back(letterCount);
    }

    // Вывести результат
    cout << "Количество букв в каждом слове: ";
    for (int i = 0; i < letterCounts.size(); i++)
    {
        cout << letterCounts[i] << " ";
    }
    cout << endl;

    return 0;
}
