/* Задача № 1
Умова:
Написати програму розстановки чорних та білих шашок на дошці заданого розміру
                                                                        ***
Що робить ця програма/цей код:
Одним із способів представлення дошки є двовимірний масив, де кожен елемент масиву є окремою клітиною на дошці.
Для розміщення шашок можна використовувати числа, щоб позначати чорні та білі шашки, наприклад, 1 і -1 відповідно.

У цій програмі ми просимо розмір дошки від користувача,
створюємо двомірний вектор для представлення дошки та використовуємо два вкладені цикли для розміщення шашок на дошці.
Далі ми виводимо розташування на екран, використовуючи символи W і B для позначення білих і чорних шашок відповідно.
Приклад виводу для дошки розміром 8x8:
Enter board size: 8
B . B . B . B
. B . B . B .
B . B . B . B
. . . . . . .
. . . . . . .
. W . W . W .
W . W . W . W
. W . W . W .
Це лише один із можливих способів вирішення цього завдання, і його можна модифікувати для задоволення більш специфічних вимог.

                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1, Програма запитує у користувача розмір дошки (кількість рядків та стовпців).
2. Створюється двовимірний вектор board для представлення дошки.
    Цей вектор має розмір n x n де n - розмір дошки, і кожен елемент вектора представляє окрему клітинку на дошці.
    Спочатку всі елементи вектора ініціалізуються нулями.
3. Використовуючи вкладені цикли, програма проходить з кожної клітинці на дошці.
    Якщо сума індексів рядка та стовпця є парною, то клітина відноситься до чорних клітин і на неї потрібно поставити чорну шашку.
    Якщо індекс рядка менше n/2 - 1, це знаходиться у верхній половині дошки і на клітину потрібно поставити чорну шашку.
    Якщо ж індекс рядка більше n/2, це знаходиться в нижній половині дошки і на клітку потрібно поставити білу шашку.
4. Результат розміщення шашок виводиться на екран.
    Якщо клітина на дошці містить білу шашку, то виводиться символ W, якщо чорну – B, якщо ж клітина порожня – точка (.).
5. Програма завершується.

Наприклад, якщо користувач ввів розмір дошки 8, програма здійснить такі дії:

1. Запросить розмір дошки користувача: Enter board size: 8
2. Створить вектор board розміром 8x8 з усіма елементами, рівними нулю.
3. Пройде по кожній клітці на дошці та розставить шашки відповідно до правил, заданих у програмі.
4. Виведе результат на екран.
5. Завершиться.

*/

#include <iostream>
#include <vector>

using namespace std;

int main()
{
    int n;
    cout << "Enter board size: ";
    cin >> n;

    // создание доски
    vector<vector<int>> board(n, vector<int>(n, 0));

    // расстановка шашек
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            if ((i + j) % 2 == 0)
            {
                if (i < n / 2 - 1)
                {
                    board[i][j] = -1; // черные шашки
                }
                else if (i > n / 2)
                {
                    board[i][j] = 1; // белые шашки
                }
            }
        }
    }

    // вывод доски
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            if (board[i][j] == 1)
            {
                cout << "W "; // белые шашки
            }
            else if (board[i][j] == -1)
            {
                cout << "B "; // черные шашки
            }
            else
            {
                cout << ". "; // пустая клетка
            }
        }
        cout << endl;
    }

    return 0;
}
