/* Задача № 4
Умова:
Написати програму, яка приймає текст та визначає кількість вживань заданого символу у кожному реченні.
                                                                        ***
Що робить ця програма/цей код:
Програма запитує користувача введення тексту та символу для пошуку.
Потім вона шукає кількість вживань символу в кожному реченні тексту та виводить результат.
Кількість вживань символу у кожному реченні зберігається у векторі counts.
                                                                        ***
Покроковий опис роботи коду/вирішення задачі:
1. Запитати у користувача текст, який потрібно обробити.
2. Запитати в користувача символ, вживання якого потрібно знайти.
3. Розділити текст на речення. Речення - це послідовність символів, які закінчуються точкою, знаком оклику або знаком питанням.
4. До кожного речення обчислити кількість вживань заданого символа. Для цього:
    1. створити лічильник вжитків, спочатку рівний 0;
    2. перебрати всі символи у реченні;
    3. якщо черговий символ збігається із заданим, збільшити лічильник на 1.
5. Вивести результати кожного речення.
6. Завершити програму.
*/

#include <iostream>
#include <string>
#include <vector>

using namespace std;

int main()
{
    string text;
    cout << "Введите текст: ";
    getline(cin, text);

    char search_char;
    cout << "Введите символ для поиска: ";
    cin >> search_char;

    vector<int> counts;
    int count = 0;
    for (int i = 0; i < text.size(); i++)
    {
        if (text[i] == search_char)
        {
            count++;
        }
        if (text[i] == '.' || text[i] == '!' || text[i] == '?')
        {
            counts.push_back(count);
            count = 0;
        }
    }

    cout << "Результаты поиска:" << endl;
    for (int i = 0; i < counts.size(); i++)
    {
        cout << "В предложении " << i + 1 << " символ \"" << search_char << "\" встретился " << counts[i] << " раз." << endl;
    }

    return 0;
}
